============================================
Invalid statements
============================================

what the heck !
y();

if (x) {
  >>>
  var y = right
}

---

(program
  (expression_statement
    (identifier)
    (ERROR (identifier) (identifier)))
  (expression_statement (function_call (identifier)))
  (if_statement (identifier) (statement_block
    (ERROR)
    (var_declaration (var_assignment (identifier) (identifier))))))

============================================
Invalid if conditions
============================================

if (uh oh)
  hmm();

ok();

---

(program
  (if_statement (identifier) (ERROR (identifier))
    (expression_statement (function_call (identifier))))
  (expression_statement (function_call (identifier))))

============================================
Invalid for loops
============================================

ok1;

for (a b c; d; e)
  wat();

ok2;

for (a; b; c d ef)
  wat();

---

(program
  (expression_statement (identifier))

  (for_statement
    (ERROR (identifier) (identifier))
    (identifier)
    (identifier)
    (identifier)
    (expression_statement (function_call (identifier))))

  (expression_statement (identifier))

  (for_statement
    (identifier)
    (identifier)
    (ERROR (identifier) (identifier))
    (identifier)
    (expression_statement (function_call (identifier)))))

============================================
Invalid statement blocks
============================================

function() { ^ & * }

---

(program
  (expression_statement (function (statement_block (ERROR)))))

============================================
Invalid objects
============================================

x = {
  key1: value1,

  abc efg,

  key2: value2
};

---

(program
  (expression_statement (assignment
    (identifier)
    (object
      (pair (identifier) (identifier))
      (ERROR (identifier) (identifier))
      (pair (identifier) (identifier))))))

============================================
Invalid items in var declarations
============================================

var
  a = 1,
  -b,
  c = 2,
  d = = = = =,
  e;

---

(program
  (var_declaration
    (var_assignment (identifier) (number))
    (ERROR (UNEXPECTED '-') (identifier))
    (var_assignment (identifier) (number))
    (ERROR (identifier) (UNEXPECTED '='))
    (identifier)))
